In [1]:
import pandas as pd

In [4]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [6]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [8]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [10]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [12]:
pd.merge(employees, departments, on="DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [14]:
pd.merge(employees, departments, on="DeptID", how="left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [16]:
pd.merge(employees, departments, on="DeptID", how="right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [18]:
pd.merge(employees, departments, on="DeptID", how="outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [32]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Score": [234, 456]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "Age": [23,25]})

In [34]:
df1

    Name  Score
0  Alice    234
1    Bob    456

In [36]:
df2

      Name  Age
0  Charlie   23
1    David   25

In [38]:
pd.concat([df1, df2])  #Vertical

      Name  Score   Age
0    Alice  234.0   NaN
1      Bob  456.0   NaN
0  Charlie    NaN  23.0
1    David    NaN  25.0

In [40]:
pd.concat([df1, df2],axis=1)  #Horizontal

    Name  Score     Name  Age
0  Alice    234  Charlie   23
1    Bob    456    David   25